num1 = int(input("pls enter number1 : "))
num2 = int(input("pls enter number2 : "))
ans = 0

if( (num1==0) or (num2==0) ):    # هرکدوم صفر باشه جواب ضرب صفره
    print("answer = ", ans)
#------------------------------------------------------------------------------    
elif(num1==1):  # اگه عدد اول یک باشه ضربش تو دومی همون عدد دوم میشه
    print("answer = ", num2)
#------------------------------------------------------------------------------
elif(num2==1):  # اگه عدد دوم یک باشه ضربش تو اولی همون عدد اول میشه
    print("answer = ", num1)
#------------------------------------------------------------------------------
elif(num1<0):         # اگه عدد اول منفی باشه
    num1 = 0 - num1;  # قرینه میکنیم
    while(num1>0):    # و ازش به عنوان شمارنده استفاده میکنیم
        ans+=num2
        num1-=1
    print("answer = ", 0-ans) # در اخر قرینه جواب رو حساب میکنیم
#------------------------------------------------------------------------------
elif(num2<0):         # اگه عدد دوم منفی باشه
    num2 = 0 - num2;  # قرینه میکنیم
    while(num2>0):    # و ازش به عنوان شمارنده استفاده میکنیم
        ans+=num1
        num2-=1
    print("answer = ", 0-ans) # در اخر قرینه جواب رو حساب میکنیم
#------------------------------------------------------------------------------
elif(num1>num2):  # ‌اگه عدد اول بزرگتر باشه از عدد دوم به عنوان شمارنده استفاده میکنیم تا حلقه کمتر تکرار بشه(بهینه سازی)
    while(num2>0):
        ans+=num1
        num2-=1
    print("answer = ", ans)
#------------------------------------------------------------------------------
elif(num1<num2):  #‌ اگه عدد دوم بزرگتر باشه از عدد اول به عنوان شمارنده استفاده میکنیم تا حلقه کمتر تکرار بشه(بهینه سازی)
    while(num1>0):
        ans+=num2
        num1-=1
    print("answer = ", ans)
#------------------------------------------------------------------------------
else:  # اگه حالتای خاص بالا نبود دیگه ضرب معمولی رو انجام میدیم
    while(num2>0):                  
        ans+=num1
        num2-=1
    print("answer = ", ans)
#MadMad_45