#include<iostream>
using namespace std;

int main()
{
    int num1, num2, ans=0;
    cout<<"pls enter two numbers : "<<endl;
    cin>>num1;
    cin>>num2;

    if( (num1==0) || (num2==0) )    ///--> هرکدوم صفر باشه جوابه ضرب صفره
    {
        cout<<"D-Bug : yekish = 0"<<endl;
        cout<<"answer = "<<ans<<endl<<endl;
    }
//---------------------------------------------------------------------------------------------------------------
    else if(num1==1)    ///--> اگه عدد اول یک باشه ضربش تو دومی همون عدد دوم میشه
    {
        cout<<"D-Bug : num1 = 1"<<endl;
        cout<<"answer = "<<num2<<endl<<endl;
    }
//---------------------------------------------------------------------------------------------------------------
    else if(num2==1)    ///--> اگه عدد دوم یک باشه ضربش تو اولی همون عدد اول میشه
    {
        cout<<"D-Bug : num2 = 1"<<endl;
        cout<<"answer = "<<num1<<endl<<endl;
    }
    //---------------------------------------------------------------------------------------------------------------
    else if(num1<0)     ///--> اگه عدد اول منفی باشه
    {
        cout<<"D-Bug : num1<0"<<endl;
        num1 = 0 - num1;  ///--> قرینه میکنیم
        while(num1>0)     ///--> و ازش به عنوان شمارنده استفاده میکنیم
        {
            ans+=num2;
            num1--;
        }
        cout<<"answer = "<<0-ans<<endl<<endl;   ///--> در اخر قرینه جواب رو حساب میکنیم
    }
//---------------------------------------------------------------------------------------------------------------
    else if(num2<0)     ///--> اگه عدد دوم منفی باشه
    {
        cout<<"D-Bug : num2<0"<<endl;
        num2 = 0 - num2;  ///--> قرینه میکنیم
        while(num2>0)     ///--> و ازش به عنوان شمارنده استفاده میکنیم
        {
            ans+=num1;
            num2--;
        }
        cout<<"answer = "<<0-ans<<endl<<endl;   ///--> در اخر قرینه جواب رو حساب میکنیم
    }
//---------------------------------------------------------------------------------------------------------------
    else if(num1>num2)                //
    {                                 //
        cout<<"D-Bug : num1>"<<endl;  ///--> ‌اگه عدد اول بزرگتر باشه از عدد دوم به عنوان شمارنده استفاده میکنیم تا حلقه کمتر تکرار بشه(بهینه سازی)
        while(num2>0)                 //
        {
            ans+=num1;
            num2--;
        }
        cout<<"answer = "<<ans<<endl<<endl;
    }
//---------------------------------------------------------------------------------------------------------------
    else if(num1<num2)                //
    {                                 //
        cout<<"D-Bug : num2>"<<endl;  ///-->‌ اگه عدد دوم بزرگتر باشه از عدد اول به عنوان شمارنده استفاده میکنیم تا حلقه کمتر تکرار بشه(بهینه سازی)
        while(num1>0)                 //
        {
            ans+=num2;
            num1--;
        }
        cout<<"answer = "<<ans<<endl<<endl;
    }
//---------------------------------------------------------------------------------------------------------------
    else                                 //
    {                                    //
        cout<<"D-Bug : anything"<<endl;  ///--> اگه حالتای خاص بالا نبود دیگه ضرب معمولی رو انجام میدیم
        while(num2>0)                    //
        {
            ans+=num1;
            num2--;
        }
        cout<<"answer = "<<ans<<endl<<endl;
    }

    return 0;
}
//MadMad_88